from config import ASSISTANT_NAME
from helpers.bot_utils import BOT_NAME, USERNAME


START_TEXT = f"👋🏻 **اهلا وسهلا**, \n\nفي بوت **{BOT_NAME}** \nانا استطيع ان ابث مباشر, وتشغيل الاغاني في المكالمة &  شكرا لأستخدامك البوت المطور @lMl10l 👑"
HELP_TEXT = f"""
🧸🩸 𝘚𝘖𝘜𝘙𝘊𝘙 𝘑𝘌𝘗𝘛𝘏𝘖𝘕 :--

\u2022 قم تشغيل مكالمة في المجموعة!
\u2022 اضف (@{USERNAME}) مع حساب المساعد  (@{ASSISTANT_NAME}) الى المجموعة!
\u2022 اعطيني كافة صلاحيات الاشراف (@{USERNAME}) & مع مساعد البوت (@{ASSISTANT_NAME}) في مجموعتك!

🧸🩸 𝘚𝘖𝘜𝘙𝘊𝘙 𝘑𝘌𝘗𝘛𝘏𝘖𝘕 :--

\u2022 `/play` - لتشغيل الاغنية
\u2022 `/stream` - لبث الفيديو في المكالمة
\u2022 `/pause` - لأيقاف الاغنية
\u2022 `/استمرار` - لأستمرار الاغنية
\u2022 `/endstream` - لأنهاء الفيديو والخروج من المكالمة
\u2022 `/restart` - لتحديث البوت
"""
ABOUT_TEXT = f"قريبأ"
